name: "Test_Warping_Layer"

input: "data"
input_dim: 1
input_dim: 3
input_dim: 100
input_dim: 100

input: "disp"
input_dim: 1
input_dim: 2
input_dim: 100
input_dim: 100
force_backward: true

layer {
  name: "flow_warping"
  type: "FlowWarping"
  bottom: "data"
  bottom: "disp"
  top: "out"
}
